app/views/orders/show.html.erb

SELECT "products".* FROM "products" INNER JOIN "product_orders" ON "products"."id" = "product_orders"."product_id" WHERE "product_orders"."order_id" = ?  [["order_id", 1]]
---
<div id="orders">
  <% @order.products.each do |product| %>