app/helpers/orders_helper.rb

SELECT "product_orders".* FROM "product_orders" WHERE "product_orders"."product_id" = ? AND "product_orders"."order_id" = ? ORDER BY "product_orders"."id" ASC LIMIT ?  [["product_id", 1], ["order_id", 7], ["LIMIT", 1]]
---
	def find_quantity(product_id,order_id)
		ProductOrder.where(product_id: product_id,order_id:order_id).first.quantity