app/helpers/shopping_carts_helper.rb

SELECT "product_shopping_carts".* FROM "product_shopping_carts" WHERE "product_shopping_carts"."product_id" = ? AND "product_shopping_carts"."shopping_cart_id" = ? ORDER BY "product_shopping_carts"."id" ASC LIMIT ?  [["product_id", 2], ["shopping_cart_id", 1], ["LIMIT", 1]]
---
	def find_quantity(product_id,shopping_cart_id)
		ProductShoppingCart.where(product_id: product_id,shopping_cart_id:shopping_cart_id).first.quantity