app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @orders = Order.all

INSERT INTO "orders" ("total", "status", "created_at", "updated_at", "user_id", "product_id") VALUES (?, ?, ?, ?, ?, ?)  [["total", nil], ["status", nil], ["created_at", "2022-06-24 05:57:20.074493"], ["updated_at", "2022-06-24 05:57:20.074493"], ["user_id", 1], ["product_id", 1]]
INSERT INTO "product_orders" ("product_id", "order_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 5], ["order_id", 8], ["quantity", 3], ["created_at", "2022-06-24 06:39:28.783881"], ["updated_at", "2022-06-24 06:39:28.783881"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
        # binding.pry
        # ProductOrder.create(product_order_params)
        @order.product_orders.create(product_order_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_user
      @user= User.find(params[:user_id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_product
      @product= Product.find(params[:product_id])