app/controllers/products_controller.rb

  def index
    @products = Product.all
    @user= User.first
---
SELECT "products".* FROM "products"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]