app/controllers/shopping_carts_controller.rb

  def index
    # @shopping_carts = ShoppingCart.all
    @user=User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create

    # @shopping_cart = ShoppingCart.new(shopping_cart_params)
    @shopping_cart= User.first.shopping_cart
    # respond_to do |format|
    #   if @shopping_cart.save
        # binding.pry
        @shopping_cart.product_shopping_carts.create(product_shopping_cart_params)
---
SELECT "product_shopping_carts".* FROM "product_shopping_carts" WHERE "product_shopping_carts"."shopping_cart_id" = ? LIMIT ?  [["shopping_cart_id", 10], ["LIMIT", 11]]
SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "shopping_carts" ("created_at", "updated_at", "user_id", "product_id") VALUES (?, ?, ?, ?)  [["created_at", "2022-06-24 07:37:03.957186"], ["updated_at", "2022-06-24 07:37:03.957186"], ["user_id", 1], ["product_id", 5]]
INSERT INTO "product_shopping_carts" ("product_id", "shopping_cart_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 2], ["shopping_cart_id", 1], ["quantity", 3], ["created_at", "2022-06-24 07:59:23.720486"], ["updated_at", "2022-06-24 07:59:23.720486"]]

    def set_shopping_cart
      @shopping_cart = ShoppingCart.find(params[:id])
---
SELECT "product_shopping_carts".* FROM "product_shopping_carts" WHERE "product_shopping_carts"."shopping_cart_id" = ?  [["shopping_cart_id", 1]]
SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def find_product
      @product= Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]