app/controllers/shopping_carts_controller.rb

  def index
    @shopping_carts = ShoppingCart.all
---
SELECT "shopping_carts".* FROM "shopping_carts" ORDER BY "shopping_carts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "product_shopping_carts".* FROM "product_shopping_carts" WHERE "product_shopping_carts"."shopping_cart_id" = ?  [["shopping_cart_id", 1]]